In [1]:
import pandas as pd
import numpy as np

data = [
    {"id": 1, "name": "shreyas", "age": 34, "place": "India", "salary": 80000},
    {"id": 2, "name": "ankit", "age": 30, "place": "USA", "salary": 70000},
    {"id": 3, "name": "james", "age": 24, "place": "France", "salary": 30600},
    {"id": 4, "name": "johnson", "age": 38, "place": "Australia", "salary": 90000},
    {"id": 5, "name": "sachin", "age": 28, "place": "India", "salary": 50000},
    {"id": 6, "name": "smith", "age": 27, "place": "Australia", "salary": 45000},
    {"id": 7, "name": "andrew", "age": 33, "place": "USA", "salary": 70000},
    {"id": 7, "name": "andrew", "age": 33, "place": "USA", "salary": 70000},
    {"id": 8, "name": "stephen", "age": None, "place": None, "salary": 30000}
]

df = pd.DataFrame(data)
print(df)

   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
6   7   andrew  33.0        USA   70000
7   7   andrew  33.0        USA   70000
8   8  stephen   NaN       None   30000

In [2]:
# get shape of df
print(df.shape)

(9, 5)

In [3]:
# drop_duplicates()
print(df.drop_duplicates(subset=["id"], keep='first'))
print("*"*50)

print()
print("Non duplicated rows...")
print(df.drop_duplicates(subset=["id"], keep=False))
print()

   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
6   7   andrew  33.0        USA   70000
8   8  stephen   NaN       None   30000
**************************************************

Non duplicated rows...
   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
8   8  stephen   NaN       None   30000

In [4]:
#duplicated()
print("Duplicated rows....")
print()

print(df[df.duplicated(subset=["id"], keep=False)])
print()

print(df[df.duplicated(subset=["id"])])

Duplicated rows....

   id    name   age place  salary
6   7  andrew  33.0   USA   70000
7   7  andrew  33.0   USA   70000

   id    name   age place  salary
7   7  andrew  33.0   USA   70000

In [5]:
# fillna() and replace()
print(df.fillna("unknown").replace(to_replace=["India", "USA"], value=["Republic of India", "United States of America"]))

   id     name      age                     place  salary
0   1  shreyas     34.0         Republic of India   80000
1   2    ankit     30.0  United States of America   70000
2   3    james     24.0                    France   30600
3   4  johnson     38.0                 Australia   90000
4   5   sachin     28.0         Republic of India   50000
5   6    smith     27.0                 Australia   45000
6   7   andrew     33.0  United States of America   70000
7   7   andrew     33.0  United States of America   70000
8   8  stephen  unknown                   unknown   30000

In [6]:
# dropna()
print(df.dropna(subset=["age"]))

   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
6   7   andrew  33.0        USA   70000
7   7   andrew  33.0        USA   70000

In [7]:
# drop() to drop column
print(df.drop(["age"], axis=1).head(3))

print()
print("*"*50)

print(df.drop([1, 2], axis=0).head(5))

   id     name   place  salary
0   1  shreyas   India   80000
1   2    ankit     USA   70000
2   3    james  France   30600

**************************************************
   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
3   4  johnson  38.0  Australia   90000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
6   7   andrew  33.0        USA   70000

In [8]:
# rename() to rename columns or index
print(df.rename(columns={"id": "Id", "name": "Name", "age": "Age", "place": "Place"}))

print()
print("#"*50)

# rename() to rename columns or index
renamed_index = df.rename(index={0: "zero", 1: "one", 2: "two", 3: "three", 4: "four", 5: "five", 
                                 6: "six", 7: "seven", 8: "eight", 9: "nine"})

print(renamed_index)

   Id     Name   Age      Place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
6   7   andrew  33.0        USA   70000
7   7   andrew  33.0        USA   70000
8   8  stephen   NaN       None   30000

##################################################
       id     name   age      place  salary
zero    1  shreyas  34.0      India   80000
one     2    ankit  30.0        USA   70000
two     3    james  24.0     France   30600
three   4  johnson  38.0  Australia   90000
four    5   sachin  28.0      India   50000
five    6    smith  27.0  Australia   45000
six     7   andrew  33.0        USA   70000
seven   7   andrew  33.0        USA   70000
eight   8  stephen   NaN       None   30000

In [9]:
# sort_values()
print(df.sort_values(by=["age", "place"], ascending=[False, True]))

   id     name   age      place  salary
3   4  johnson  38.0  Australia   90000
0   1  shreyas  34.0      India   80000
6   7   andrew  33.0        USA   70000
7   7   andrew  33.0        USA   70000
1   2    ankit  30.0        USA   70000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
2   3    james  24.0     France   30600
8   8  stephen   NaN       None   30000

In [10]:
# describe()
print(df.describe())

             id       age        salary
count  9.000000   8.00000      9.000000
mean   4.777778  30.87500  59511.111111
std    2.438123   4.48609  21468.607573
min    1.000000  24.00000  30000.000000
25%    3.000000  27.75000  45000.000000
50%    5.000000  31.50000  70000.000000
75%    7.000000  33.25000  70000.000000
max    8.000000  38.00000  90000.000000

In [11]:
# groupby() and aggregation
print("MIN SALARY")
print(df.groupby(["place"]).min("salary"))
print("#"*50)

print("MAX SALARY")
print(df.groupby(["place"]).aggregate({"salary": 'max'}))
print("#"*50)

print("MEAN SALARY")
print(df.groupby(["place"])["salary"].mean())
print("#"*50)

print("COUNT SALARY")
print(df.groupby(["place"])["age"].count())

MIN SALARY
           id   age  salary
place
Australia   4  27.0   45000
France      3  24.0   30600
India       1  28.0   50000
USA         2  30.0   70000
##################################################
MAX SALARY
           salary
place
Australia   90000
France      30600
India       80000
USA         70000
##################################################
MEAN SALARY
place
Australia    67500.0
France       30600.0
India        65000.0
USA          70000.0
Name: salary, dtype: float64
##################################################
COUNT SALARY
place
Australia    2
France       1
India        2
USA          3
Name: age, dtype: int64

In [12]:
# head()
print(df.head(4))
print()

# tail()
print(df.tail(4))

   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000

   id     name   age      place  salary
5   6    smith  27.0  Australia   45000
6   7   andrew  33.0        USA   70000
7   7   andrew  33.0        USA   70000
8   8  stephen   NaN       None   30000

In [13]:
# loc[]
print(df.loc[2:5, ["name", "age", "salary"]].head(3))

print()
print("*"*50)
print(renamed_index.loc[["one", "two"], :])

print()
print("*"*50)
print(renamed_index.loc[["one", "two", "three"]])

      name   age  salary
2    james  24.0   30600
3  johnson  38.0   90000
4   sachin  28.0   50000

**************************************************
     id   name   age   place  salary
one   2  ankit  30.0     USA   70000
two   3  james  24.0  France   30600

**************************************************
       id     name   age      place  salary
one     2    ankit  30.0        USA   70000
two     3    james  24.0     France   30600
three   4  johnson  38.0  Australia   90000

In [14]:
# iloc[]
print(renamed_index.iloc[0:3, :].head(3))

print()
print("*"*50)

print(renamed_index.iloc[:, 0:3].head(4))

      id     name   age   place  salary
zero   1  shreyas  34.0   India   80000
one    2    ankit  30.0     USA   70000
two    3    james  24.0  France   30600

**************************************************
       id     name   age
zero    1  shreyas  34.0
one     2    ankit  30.0
two     3    james  24.0
three   4  johnson  38.0

In [15]:
new_data = [
    {"id": 1, "profession": "doctor"},
    {"id": 2, "profession": "Buisnessman"},
    {"id": 3, "profession": "Engineer"},
    {"id": 4, "profession": "scientist"},
    {"id": 5, "profession": "doctor"},
    {"id": 10, "profession": "Manager"},
    {"id": 11, "profession": "Accountant"},
]

df1= df
print(df1)
print("*"*50)
df2 = pd.DataFrame(new_data)
print(df2)

   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
6   7   andrew  33.0        USA   70000
7   7   andrew  33.0        USA   70000
8   8  stephen   NaN       None   30000
**************************************************
   id   profession
0   1       doctor
1   2  Buisnessman
2   3     Engineer
3   4    scientist
4   5       doctor
5  10      Manager
6  11   Accountant

In [16]:
# join()
print("Inner Join")
print(df1.join(df2, lsuffix="_1", rsuffix="_2", sort=True, how="inner"))

print()
print("*"*50)

print("Left Join")
print(df1.join(df2, lsuffix="_1", rsuffix="_2", sort=True, how="left"))

Inner Join
   id_1     name   age      place  salary  id_2   profession
0     1  shreyas  34.0      India   80000     1       doctor
1     2    ankit  30.0        USA   70000     2  Buisnessman
2     3    james  24.0     France   30600     3     Engineer
3     4  johnson  38.0  Australia   90000     4    scientist
4     5   sachin  28.0      India   50000     5       doctor
5     6    smith  27.0  Australia   45000    10      Manager
6     7   andrew  33.0        USA   70000    11   Accountant

**************************************************
Left Join
   id_1     name   age      place  salary  id_2   profession
0     1  shreyas  34.0      India   80000   1.0       doctor
1     2    ankit  30.0        USA   70000   2.0  Buisnessman
2     3    james  24.0     France   30600   3.0     Engineer
3     4  johnson  38.0  Australia   90000   4.0    scientist
4     5   sachin  28.0      India   50000   5.0       doctor
5     6    smith  27.0  Australia   45000  10.0      Manager
6     7   andrew  33.0        USA   70000  11.0   Accountant
7     7   andrew  33.0        USA   70000   NaN          NaN
8     8  stephen   NaN       None   30000   NaN          NaN

In [17]:
print("Right Join")
print(df1.join(df2, lsuffix="_1", rsuffix="_2", sort=True, how="right"))

print()
print("*"*50)

print("Outer Join")
print(df1.join(df2, lsuffix="_1", rsuffix="_2", sort=True, how="outer"))

Right Join
   id_1     name   age      place  salary  id_2   profession
0     1  shreyas  34.0      India   80000     1       doctor
1     2    ankit  30.0        USA   70000     2  Buisnessman
2     3    james  24.0     France   30600     3     Engineer
3     4  johnson  38.0  Australia   90000     4    scientist
4     5   sachin  28.0      India   50000     5       doctor
5     6    smith  27.0  Australia   45000    10      Manager
6     7   andrew  33.0        USA   70000    11   Accountant

**************************************************
Outer Join
   id_1     name   age      place  salary  id_2   profession
0     1  shreyas  34.0      India   80000   1.0       doctor
1     2    ankit  30.0        USA   70000   2.0  Buisnessman
2     3    james  24.0     France   30600   3.0     Engineer
3     4  johnson  38.0  Australia   90000   4.0    scientist
4     5   sachin  28.0      India   50000   5.0       doctor
5     6    smith  27.0  Australia   45000  10.0      Manager
6     7   andrew  33.0        USA   70000  11.0   Accountant
7     7   andrew  33.0        USA   70000   NaN          NaN
8     8  stephen   NaN       None   30000   NaN          NaN

In [18]:
# merge()
print("Inner Join")
print(pd.merge(df1, df2, on="id", how="inner"))

print()
print("*"*50)

print("Left Join")
print(pd.merge(df1, df2, on="id", how="left"))

Inner Join
   id     name   age      place  salary   profession
0   1  shreyas  34.0      India   80000       doctor
1   2    ankit  30.0        USA   70000  Buisnessman
2   3    james  24.0     France   30600     Engineer
3   4  johnson  38.0  Australia   90000    scientist
4   5   sachin  28.0      India   50000       doctor

**************************************************
Left Join
   id     name   age      place  salary   profession
0   1  shreyas  34.0      India   80000       doctor
1   2    ankit  30.0        USA   70000  Buisnessman
2   3    james  24.0     France   30600     Engineer
3   4  johnson  38.0  Australia   90000    scientist
4   5   sachin  28.0      India   50000       doctor
5   6    smith  27.0  Australia   45000          NaN
6   7   andrew  33.0        USA   70000          NaN
7   7   andrew  33.0        USA   70000          NaN
8   8  stephen   NaN       None   30000          NaN

In [19]:
print("Right Join")
print(pd.merge(df1, df2, on="id", how="right"))

print()
print("*"*50)

print("Outer Join")
print(pd.merge(df1, df2, on="id", how="outer"))

Right Join
   id     name   age      place   salary   profession
0   1  shreyas  34.0      India  80000.0       doctor
1   2    ankit  30.0        USA  70000.0  Buisnessman
2   3    james  24.0     France  30600.0     Engineer
3   4  johnson  38.0  Australia  90000.0    scientist
4   5   sachin  28.0      India  50000.0       doctor
5  10      NaN   NaN        NaN      NaN      Manager
6  11      NaN   NaN        NaN      NaN   Accountant

**************************************************
Outer Join
    id     name   age      place   salary   profession
0    1  shreyas  34.0      India  80000.0       doctor
1    2    ankit  30.0        USA  70000.0  Buisnessman
2    3    james  24.0     France  30600.0     Engineer
3    4  johnson  38.0  Australia  90000.0    scientist
4    5   sachin  28.0      India  50000.0       doctor
5    6    smith  27.0  Australia  45000.0          NaN
6    7   andrew  33.0        USA  70000.0          NaN
7    7   andrew  33.0        USA  70000.0          NaN
8    8  stephen   NaN       None  30000.0          NaN
9   10      NaN   NaN        NaN      NaN      Manager
10  11      NaN   NaN        NaN      NaN   Accountant

In [20]:
add_data = [
    {"id": 10, "name": "Yashas", "age": 24, "place": "India", "salary": 30000},
    {"id": 11, "name": "Tejas", "age": 28, "place": "Canada", "salary": 60000},
]

df3 = pd.DataFrame(add_data)

In [21]:
# concat()
print(pd.concat([df1, df3]))

   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
6   7   andrew  33.0        USA   70000
7   7   andrew  33.0        USA   70000
8   8  stephen   NaN       None   30000
0  10   Yashas  24.0      India   30000
1  11    Tejas  28.0     Canada   60000

In [22]:
print(df1["salary"])
print("*"*50)
print()

# astype()rea
print(df1["salary"].astype(float))

0    80000
1    70000
2    30600
3    90000
4    50000
5    45000
6    70000
7    70000
8    30000
Name: salary, dtype: int64
**************************************************

0    80000.0
1    70000.0
2    30600.0
3    90000.0
4    50000.0
5    45000.0
6    70000.0
7    70000.0
8    30000.0
Name: salary, dtype: float64

In [23]:
# filtering
print(df[(df["age"] <=30) & (df["salary"] >= 50000)])

print()
print("*"*50)

print(df[df["place"].isin(["India", "USA"])])

   id    name   age  place  salary
1   2   ankit  30.0    USA   70000
4   5  sachin  28.0  India   50000

**************************************************
   id     name   age  place  salary
0   1  shreyas  34.0  India   80000
1   2    ankit  30.0    USA   70000
4   5   sachin  28.0  India   50000
6   7   andrew  33.0    USA   70000
7   7   andrew  33.0    USA   70000

In [24]:
# notna()
print("Original df ...")
print(df1)

print("*"*50)
print(df1[~df1["age"].notna()])

print("*"*50)
print(df1[df1["age"].notna()])

Original df ...
   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
6   7   andrew  33.0        USA   70000
7   7   andrew  33.0        USA   70000
8   8  stephen   NaN       None   30000
**************************************************
   id     name  age place  salary
8   8  stephen  NaN  None   30000
**************************************************
   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
6   7   andrew  33.0        USA   70000
7   7   andrew  33.0        USA   70000

In [25]:
# notnull()
print("*"*50)
print(df1[~df1["age"].notnull()])

print("*"*50)
print(df1[df1["age"].notnull()])

**************************************************
   id     name  age place  salary
8   8  stephen  NaN  None   30000
**************************************************
   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
6   7   andrew  33.0        USA   70000
7   7   andrew  33.0        USA   70000

In [26]:
# isnull()
print("*"*50)
print(df1[df1["age"].isnull()])

print("*"*50)
print(df1[~df1["age"].isnull()])

**************************************************
   id     name  age place  salary
8   8  stephen  NaN  None   30000
**************************************************
   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
6   7   andrew  33.0        USA   70000
7   7   andrew  33.0        USA   70000

In [27]:
# reset_index()
print("Original dataframe ..")
print(renamed_index.head(3))

print()
print("*"*50)
print(renamed_index.reset_index().head(3))

print()
print("*"*50)
print(renamed_index.reset_index(drop=True).head(3))

Original dataframe ..
      id     name   age   place  salary
zero   1  shreyas  34.0   India   80000
one    2    ankit  30.0     USA   70000
two    3    james  24.0  France   30600

**************************************************
  index  id     name   age   place  salary
0  zero   1  shreyas  34.0   India   80000
1   one   2    ankit  30.0     USA   70000
2   two   3    james  24.0  France   30600

**************************************************
   id     name   age   place  salary
0   1  shreyas  34.0   India   80000
1   2    ankit  30.0     USA   70000
2   3    james  24.0  France   30600

In [28]:
# list index and columns for renamed_index dataframe
print(renamed_index.index)
print("*"*50)
print(renamed_index.columns)

Index(['zero', 'one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight'], dtype='object')
**************************************************
Index(['id', 'name', 'age', 'place', 'salary'], dtype='object')

In [29]:
# set_index()
print("Original df")
print(df1.head(4))

print("#"*50)
print(df1.set_index([df1.index*2]).head(4))

print("*"*50)
print(df1.set_index([df1['name']]).head(4))

print("*"*50)
print(df1.set_index([renamed_index.index], drop=True).head(4))

Original df
   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000
##################################################
   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
2   2    ankit  30.0        USA   70000
4   3    james  24.0     France   30600
6   4  johnson  38.0  Australia   90000
**************************************************
         id     name   age      place  salary
name
shreyas   1  shreyas  34.0      India   80000
ankit     2    ankit  30.0        USA   70000
james     3    james  24.0     France   30600
johnson   4  johnson  38.0  Australia   90000
**************************************************
       id     name   age      place  salary
zero    1  shreyas  34.0      India   80000
one     2    ankit  30.0        USA   70000
two     3    james  24.0     France   30600
three   4  johnson  38.0  Australia   90000

In [30]:
# apply() and map()
print("Original df\n")
print(df1)

print("#"*50)

df1['Seniority'] = df1["age"].apply(lambda x: 'Senior' if x> 35 else 'Non senior')
print(df1)

Original df

   id     name   age      place  salary
0   1  shreyas  34.0      India   80000
1   2    ankit  30.0        USA   70000
2   3    james  24.0     France   30600
3   4  johnson  38.0  Australia   90000
4   5   sachin  28.0      India   50000
5   6    smith  27.0  Australia   45000
6   7   andrew  33.0        USA   70000
7   7   andrew  33.0        USA   70000
8   8  stephen   NaN       None   30000
##################################################
   id     name   age      place  salary   Seniority
0   1  shreyas  34.0      India   80000  Non senior
1   2    ankit  30.0        USA   70000  Non senior
2   3    james  24.0     France   30600  Non senior
3   4  johnson  38.0  Australia   90000      Senior
4   5   sachin  28.0      India   50000  Non senior
5   6    smith  27.0  Australia   45000  Non senior
6   7   andrew  33.0        USA   70000  Non senior
7   7   andrew  33.0        USA   70000  Non senior
8   8  stephen   NaN       None   30000  Non senior

In [31]:
print(f"{df}\n")

print("df.at supports label based index and column selection\n")
print(f"{df.at[0, 'name']}\n")

print("df.iat supports position based index and column selection\n")
print(df.iat[0, 2])

   id     name   age      place  salary   Seniority
0   1  shreyas  34.0      India   80000  Non senior
1   2    ankit  30.0        USA   70000  Non senior
2   3    james  24.0     France   30600  Non senior
3   4  johnson  38.0  Australia   90000      Senior
4   5   sachin  28.0      India   50000  Non senior
5   6    smith  27.0  Australia   45000  Non senior
6   7   andrew  33.0        USA   70000  Non senior
7   7   andrew  33.0        USA   70000  Non senior
8   8  stephen   NaN       None   30000  Non senior

df.at supports label based index and column selection

shreyas

df.iat supports position based index and column selection

34.0

In [32]:
# iterrows(), itertuples()

for index, row in df.iterrows():
    print(f"{row['name']}, {row['age']}")

print()

for row in df.itertuples(index=True, name='Pandas'):
    print(f"{getattr(row, 'name')}, {getattr(row, 'age')}")

shreyas, 34.0
ankit, 30.0
james, 24.0
johnson, 38.0
sachin, 28.0
smith, 27.0
andrew, 33.0
andrew, 33.0
stephen, nan

shreyas, 34.0
ankit, 30.0
james, 24.0
johnson, 38.0
sachin, 28.0
smith, 27.0
andrew, 33.0
andrew, 33.0
stephen, nan

In [34]:
# apply filter conditions
print(df1[(df1["age"] >= 28) & (df1["salary"] < 80000)])

   id    name   age  place  salary   Seniority
1   2   ankit  30.0    USA   70000  Non senior
4   5  sachin  28.0  India   50000  Non senior
6   7  andrew  33.0    USA   70000  Non senior
7   7  andrew  33.0    USA   70000  Non senior